Конфигурация/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСПользователями/Ext/Module.bsl
// Возвращает текущего пользователя, соответствующего пользователю информационной базы,
// который авторизовался в 1С:Предприятии 8.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//
Функция ТекущийПользователь(ДоступныеПользователи = Неопределено, Организация = Неопределено, Отказ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДоступныеПользователи = Неопределено Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		ТекущийПользователь = ДоступныеПользователи.Получить(Организация);	
		Если ТекущийПользователь = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Организация '%1' недоступна пользователю '%2'", Организация, ПараметрыСеанса.ТекущийПользователь), , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийПользователь;
	
КонецФункции

// Заполняет параметр сеанса ТекущийПользователь значением пользователя, найденному по пользователю
// информационной базы под которым запущен сеанс.
// 
// Если пользователь не найден, то при наличии полных прав создается новый пользователь
// в справочнике, иначе вызывается исключение.
// 
Процедура УстановитьПараметрСеансаТекущийПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ();
	
	НачатьТранзакцию();
	
	Попытка
		ПользовательНеНайден = Ложь;
		СоздатьПользователя  = Ложь;
		СсылкаНового         = Неопределено;
		
		ТекущийПользователь = Неопределено;
		
		Если ПустаяСтрока(ПользователиИнформационнойБазы.ТекущийПользователь().Имя) Тогда
			
			СвойстваНеуказанногоПользователя = СвойстваНеуказанногоПользователя();
			
			ИмяПользователя       = СвойстваНеуказанногоПользователя.ПолноеИмя;
			ПолноеИмяПользователя = СвойстваНеуказанногоПользователя.ПолноеИмя;
			СсылкаНового          = СвойстваНеуказанногоПользователя.СтандартнаяСсылка;
			
			Если СвойстваНеуказанногоПользователя.Ссылка = Неопределено Тогда
				ПользовательНеНайден = Истина;
				СоздатьПользователя  = Истина;
				ИдентификаторПользователяИБ = "";
			Иначе
				ТекущийПользователь = СвойстваНеуказанногоПользователя.Ссылка;
			КонецЕсли;
			
		Иначе
			ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
			ИдентификаторПользователяИБ =
				ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
			
			Запрос = Новый Запрос;
			Запрос.Параметры.Вставить("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	Пользователи.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
				|	И НЕ Пользователи.ВходЗапрещен
				|
				|УПОРЯДОЧИТЬ ПО
				|	Пользователи.Основной УБЫВ";
				
			РезультатПользователи = Запрос.Выполнить();			
			
			Если РезультатПользователи.Пустой() Тогда
				Если ЭтоПолноправныйПользователь(, Ложь) Тогда
					
					ТекущийПользовательИБ       = ПользователиИнформационнойБазы.ТекущийПользователь();
					ИмяПользователя             = ТекущийПользовательИБ.Имя;
					ПолноеИмяПользователя       = ТекущийПользовательИБ.ПолноеИмя;
					ИдентификаторПользователяИБ = ТекущийПользовательИБ.УникальныйИдентификатор;
					ПользовательПоНаименованию  = СсылкаПользователяПоПолномуНаименованию(ПолноеИмяПользователя);
					
					Если ПользовательПоНаименованию = Неопределено Тогда
						ПользовательНеНайден = Истина;
						СоздатьПользователя  = Истина;
					Иначе
						ТекущийПользователь = ПользовательПоНаименованию;
					КонецЕсли;
				Иначе
					ПользовательНеНайден = Истина;
				КонецЕсли;
			Иначе
				Выборка = РезультатПользователи.Выбрать();
				Выборка.Следующий();
				ТекущийПользователь = Выборка.Ссылка;
			КонецЕсли;

		КонецЕсли;
		
		Если СоздатьПользователя Тогда
			
			Если СсылкаНового = Неопределено Тогда
				СсылкаНового = Справочники.Пользователи.ПолучитьСсылку();
			КонецЕсли;
			
			ТекущийПользователь = СсылкаНового;
			
			НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.Наименование                = ПолноеИмяПользователя;
			НовыйПользователь.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;
			НовыйПользователь.УстановитьСсылкуНового(СсылкаНового);
			
			Попытка
				НовыйПользователь.Записать();
			Исключение
				ТекстСообщенияОбОшибке = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Авторизация не выполнена. Работа системы будет завершена.
					           |Пользователь: %1 не найден в справочнике ""Пользователи"".
					           |
					           |При попытке добавления пользователя в справочник возникла ошибка:
					           |""%2"".
					           |
					           |Обратитесь к администратору.'"),
					ПолноеИмяПользователя,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) );
				ВызватьИсключение ТекстСообщенияОбОшибке;
			КонецПопытки;
			
		ИначеЕсли ПользовательНеНайден Тогда
			ТекстСообщенияОбОшибке = НСтр("ru = 'Авторизация не выполнена. Работа системы будет завершена.
					                                    |
					                                    |Пользователь ""%1"" не найден в справочнике ""Пользователи"".
					                                    |
					                                    |Обратитесь к администратору.'");
														
			ТекстСообщенияОбОшибке = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ИмяПользователя);
			
			ВызватьИсключение ТекстСообщенияОбОшибке;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если ТекущийПользователь = Неопределено Тогда
		
		ТекстСообщенияОбОшибке = НСтр("ru = 'Авторизация не выполнена. Работа системы будет завершена.
		                                    |Пользователь ""%1"" не найден в справочнике ""Пользователи"".
		                                    |Обратитесь к администратору.'");
		
		
		ТекстСообщенияОбОшибке = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ИмяПользователя) +
			НСтр("ru = '
			           |Возникла внутренняя ошибка при поиске пользователя.'");
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецЕсли;
	
	Если ТекущийПользователь.ВходЗапрещен Тогда
		ТекстСообщенияОбОшибке = НСтр("ru = 'Пользователю ""%1"" запрещен вход в систему!
					                        |
					                        |Обратитесь к администратору.'");
		ТекстСообщенияОбОшибке = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ИмяПользователя);
		
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры // УстановитьПараметрСеансаТекущийПользователь

////////////////////////////////////////////////////////////////////////////////
Функция ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления(Организация = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	Возврат Организация.КонтрольДоступаКСчетамДоверительногоУправления;
	
КонецФункции

// Возвращает доступность хотя бы одной из указанных ролей или полноправность
// пользователя (текущего или указанного) без учета привилегированного режима.
//
// Параметры:
//  ИменаРолей   - Строка - имена ролей, разделенные запятыми, доступность которых проверяется.
//
//  Пользователь - Неопределено - проверяется текущий пользователь ИБ;
//                 СправочникСсылка.Пользователи,
//                    пользователя ИБ по уникальному идентификатору,
//                    заданному в реквизите ИдентификаторПользователяИБ
//                    Прим.: если пользователь ИБ не найден, возвращается Ложь.
//                 ПользовательИнформационнойБазы - проверяется указанный
//                    пользователь ИБ
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы одна из указанных ролей доступна,
//           или функция ЭтоПолноправныйПользователь(Пользователь) возвращает Истина.
//
Функция РолиДоступны(Знач ИменаРолей, Пользователь = Неопределено) Экспорт
	
	Если ЭтоПолноправныйПользователь(Пользователь, Ложь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Или Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
	ИначеЕсли ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		ПользовательИБ = Пользователь;
		
	Иначе
		// Указан не текущий пользователь.
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
		
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УказанТекущийПользовательИБ =
		(ПользовательИБ.УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	МассивИменРолей = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаРолей);
	
	Для каждого ИмяРоли Из МассивИменРолей Цикл
		Если УказанТекущийПользовательИБ Тогда
			Если РольДоступна(СокрЛП(ИмяРоли)) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.Найти(СокрЛП(ИмяРоли))) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет совокупное наличие прав доступа к объекту.
//
// Параметры:
//  Объект       - Объект - объект конфигурации для которого можно получить метаданные
//				 - Строка - полное имя объекта конфигурации
//  ПраваДоступа - Строка - права доступа, разделенные запятыми, доступность которых проверяется.
//
//  Пользователь - Неопределено - текущий пользователь ИБ;
//                 ПользовательИнформационнойБазы - проверяется указанный пользователь ИБ
//
// Возвращаемое значение:
//  Булево - Истина, если все перечисленные права установлены или ложь, в противном случае
//
Функция ПраваДоступны(Объект, Знач ПраваДоступа, Пользователь = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(Объект);
	Иначе
		МетаданныеОбъекта = Объект.Метаданные()	
	КонецЕсли;
	
	ПраваДоступа = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПраваДоступа);
	
	Для каждого ПравоДоступа Из ПраваДоступа Цикл
		Если Не ПравоДоступа(ПравоДоступа, МетаданныеОбъекта, Пользователь) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПраваДоступны

Функция ЕстьПраваНаРедактированиеДокумента(Документ, Пользователь = Неопределено) Экспорт
	
	Если Документ.Проведен Тогда
		Возврат ПравоДоступа("ИнтерактивноеИзменениеПроведенных", Документ.Метаданные());
	КонецЕсли;
	
	Возврат ПравоДоступа("Редактирование", Документ.Метаданные());
	
КонецФункции // ЕстьПраваНаРедактированиеДокумента

// Проверяет, является ли текущий или указанный пользователь полноправным.
// 
// Полноправным считается пользователь, который
// а) при не пустом списке пользователей информационной базы имеет роль ПолныеПрава
// б) при пустом списке пользователей информационной базы
//    основная роль конфигурации не задана или ПолныеПрава.
//
// Параметры:
//  Пользователь:
//    - Неопределено (проверяется текущий пользователь ИБ)
//    - СправочникСсылка.Пользователи
//    - ПользовательИнформационнойБазы - проверяется указанный пользователь ИБ
//
//  УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда
//    функция возвращает Истина, когда установлен привилегированный режим.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоПолноправныйПользователь(Пользователь = Неопределено, УчитыватьПривилегированныйРежим = Истина) Экспорт
	
	Если УчитыватьПривилегированныйРежим И ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		ПользовательИБ = Пользователь;
		
	ИначеЕсли Пользователь = Неопределено ИЛИ Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
	Иначе
		// Задан не текущий пользователь.
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
		
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПользовательИБ.УникальныйИдентификатор <> ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
		// Для не текущего пользователя ИБ проверяются роли в записанном пользователе ИБ.
		Возврат ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава)
		
	Иначе
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			// Для текущего пользователя ИБ проверяются роли не в записанном пользователе ИБ,
			// а роли в текущем сеансе.
			Возврат РольДоступна(Метаданные.Роли.ПолныеПрава)
		Иначе
			// Для неуказанного пользователя ИБ проверяется основная роль конфигурации:
			// должна быть роль ПолныеПрава или не указана (привилегированный режим).
			Возврат Метаданные.ОсновныеРоли.Количество() = 0 Или Метаданные.ОсновныеРоли.Содержит(Метаданные.Роли.ПолныеПрава);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

// Проверяет связан ли пользовательИБ с элементом справочника Пользователи или
// элементом справочника ВнешниеПользователи.
// 
// Параметры:
//  ПользовательИБ - Строка - имя пользователя ИБ.
//                   УникальныйИдентификатор - уникальный идентификатор пользователя ИБ.
//                   ПользовательИнформационнойБазы.
//
//  УчетнаяЗапись  - ПользовательИнформационнойБазы (возвращаемое значение).
//
// Возвращаемое значение:
//  Булево. Истина, если пользователь ИБ существует и его идентификатор
//   используется либо в справочнике Пользователи, либо в справочнике ВнешниеПользователи.
//
Функция ПользовательИБЗанят(ПользовательИБ, УчетнаяЗапись = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ПользовательИБ) = Тип("Строка") Тогда
		УчетнаяЗапись = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИБ);
		
	ИначеЕсли ТипЗнч(ПользовательИБ) = Тип("УникальныйИдентификатор") Тогда
		УчетнаяЗапись = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательИБ);
	Иначе
		УчетнаяЗапись = ПользовательИБ;
	КонецЕсли;
	
	Если УчетнаяЗапись = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПользовательПоИдентификаторуСуществует(
		УчетнаяЗапись.УникальныйИдентификатор);
	
КонецФункции

// Определяет наличие элемента в справочнике Пользователи
// или справочнике ВнешниеПользователи по уникальному идентификатору
// пользователя информационной.
//  Функция используется для проверки наличия связи пользователяИБ только
// с одним элементом справочников Пользователи, ВнешниеПользователи.
//
// Параметры:
//  УникальныйИдентификатор - идентификатор пользователя ИБ.
//
//  СсылкаНаТекущего - СправочникСсылка.Пользователи,
//                     СправочникСсылка.ВнешниеПользователи - исключить
//                       указанную ссылку из поиска.
//                     Неопределено - искать среди всех элементов справочников.
//
//  НайденныйПользователь (Возвращаемое значение):
//                     Неопределено - пользователь не существует.
//                     СправочникСсылка.Пользователи,
//                     СправочникСсылка.ВнешниеПользователи, если найден.
//
//  ИдентификаторПользователяСервиса - Булево.
//                     Ложь   - проверять ИдентификаторПользователяИБ.
//                     Истина - проверять ИдентификаторПользователяСервиса.
//
// Возвращаемое значение:
//  Булево.
//
Функция ПользовательПоИдентификаторуСуществует(УникальныйИдентификатор,
     СсылкаНаТекущего = Неопределено, НайденныйПользователь = Неопределено, ИдентификаторПользователяСервиса = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаТекущего", СсылкаНаТекущего);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &УникальныйИдентификатор
		|	И Пользователи.Ссылка <> &СсылкаНаТекущего";
	
	Результат = Ложь;
	НайденныйПользователь = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НайденныйПользователь = Выборка.Пользователь;
			Результат = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПользователяПоПолномуНаименованию(ПолноеИмя)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &ПолноеИмя";
	
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	Результат = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если НЕ ПользовательИБЗанят(Выборка.ИдентификаторПользователяИБ) Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает свойства пользователя для пользователя ИБ с пустым именем.
Функция СвойстваНеуказанногоПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Свойства = Новый Структура;
	
	// Ссылка на найденный элемент справочника
	// соответствующий неуказанному пользователю.
	Свойства.Вставить("Ссылка", Неопределено);
	
	// Ссылка, используемая для поиска и создания
	// неуказанного пользователя в справочнике Пользователи.
	Свойства.Вставить("СтандартнаяСсылка", Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор("aa00559e-ad84-4494-88fd-f0826edc46f0")));
	
	// Полное имя, которое устанавливается в элемент справочника Пользователи
	// при создании несуществующего неуказанного пользователя.
	Свойства.Вставить("ПолноеИмя", НСтр("ru = '<Не указан>'"));
	
	// Полное имя, которое используется для поиска неуказанного пользователя
	// старым способом, необходимым для поддержки старых версий
	// неуказанного пользователя. Это имя не требуется изменять.
	Свойства.Вставить("ПолноеИмяДляПоиска", НСтр("ru = '<Не указан>'"));
	
	// Поиск по уникальному идентификатору.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Свойства.СтандартнаяСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЗначениеИстина
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	НачатьТранзакцию();
	
	Попытка
		Если Запрос.Выполнить().Пустой() Тогда
			Запрос.УстановитьПараметр("ПолноеИмя", Свойства.ПолноеИмяДляПоиска);
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Наименование = &ПолноеИмя";
				
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Свойства.Ссылка = Выборка.Ссылка;
			КонецЕсли;
		Иначе
			Свойства.Ссылка = Свойства.СтандартнаяСсылка;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Свойства;
	
КонецФункции

// Проверяет, выполняется ли запуск с пустым списком пользователей и возможность такого запуска.
Функция ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ(ВернутьТекстОшибки = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(ТекущийПользовательИБ.Имя) И Не СистемныеФункции.ЭтоФоновоеЗадание() Тогда // т.к. основная роль у нас не используется, просто запретим такой запуск
		ТекстОшибки =
			НСтр("ru = 'Запуск с пустым списком пользователей информационной базы невозможен.
			           |Необходимо добавить администратора системы с двумя ролями
			           |""Администратор системы"", ""Полные права"" и повторить запуск программы от его имени.
			           |
			           |Для перехода к списку пользователей информационной базы необходимо открыть
			           |Конфигуратор и воспользоваться пунктом меню ""Администрирование - Пользователи"".'");
		
		Если НЕ ВернутьТекстОшибки Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Проверяет возможность работы пользователя на копии информационной базы
Функция ПроверитьВозможностьПодключенияККопииИнформационнойБазы() Экспорт
	
	// подключение доступно (см. задачу #441816):
	//	1. всем пользователям с полными правами
	//	2. при наличии подключенной роли "ПодключениеККопииИнформационнойБазы"
	//	3. к копиям "AssetManagementHanty*" указанной ниже группе
	//	4. к копиям "AssetManagement*Copy1" указанной ниже группе
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если ЭтоПолноправныйПользователь(ТекущийПользовательИБ, Ложь) Тогда
		Возврат Истина;
		
	ИначеЕсли РольДоступна(Метаданные.Роли.ПодключениеККопииИнформационнойБазы) Тогда
		Возврат Истина;
		
	Иначе
		ГруппыПользователей = Новый Структура("AssetManagementHanty, AssetManagement495Copy1, AssetManagement518Copy1");
		
		// #ТехДолг: пока хардкод, но в будущем хранить в константах
		ГруппыПользователей.AssetManagementHanty    = СтрРазделить(ВРег("\\REGION\Kapashilova,\\REGION\Dudova,\\REGION\Tsvetkova"), ",");
		ГруппыПользователей.AssetManagement495Copy1 = СтрРазделить(ВРег("\\REGION\Kapashilova,\\REGION\Dudova,\\REGION\Tsvetkova,\\REGION\lebedeva,\\REGION\Maistrenko,\\REGION\mischenko,\\REGION\motoraeva,\\REGION\tarasova-lv"), ",");
		ГруппыПользователей.AssetManagement518Copy1 = ГруппыПользователей.AssetManagement495Copy1;
		
		ИмяГруппыПользователей = ВРег(СистемныеФункции.ПолучитьИмяИнформационноБазы());
		
		Если СтрНачинаетсяС(ИмяГруппыПользователей, ВРег("AssetManagementHanty")) Тогда // по Хантам несколько баз за разные годы
			ИмяГруппыПользователей = ВРег("AssetManagementHanty");
		КонецЕсли;
		
		ГруппаПользователей = Неопределено;
		Если Не ГруппыПользователей.Свойство(ИмяГруппыПользователей, ГруппаПользователей) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ПользовательОС = ВРег(ТекущийПользовательИБ.ПользовательОС);
				
		Возврат ГруппаПользователей.Найти(ПользовательОС) <> Неопределено;
		
	КонецЕсли;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ГРУППЫ ПОЛЬЗОВАТЕЛЕЙ

// Процедура ОбновитьСоставГруппПользователей обновляет в регистре сведений
// "Состав групп пользователей" соответствие групп пользователей и пользователей
// с учетом иерархии групп пользователей (родитель включает пользователей порожденных групп).
//  Эти данные требуются для формы списка и формы выбора пользователей.
//  Данные регистра могут быть применены в других целях для повышения производительности,
// т.к. не требуется работать с иерархией на языке запросов.
//
// Параметры:
//  ГруппаПользователей - СправочникСсылка.ГруппыПользователей
//
Процедура ОбновитьСоставГруппПользователей(Знач ГруппаПользователей) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ГруппаПользователей) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Подготовка групп родителей.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаГруппРодителей.Родитель,
		|	ТаблицаГруппРодителей.Ссылка
		|ПОМЕСТИТЬ ТаблицаГруппРодителей
		|ИЗ
		|	&ТаблицаГруппРодителей КАК ТаблицаГруппРодителей");
		
	Запрос.УстановитьПараметр("ТаблицаГруппРодителей", ТаблицаГруппРодителей("Справочник.ГруппыПользователей"));
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	// Выполнение для текущий группы и каждой группы-родителя.
	Пока НЕ ГруппаПользователей.Пустая() Цикл
		Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
		
		Если ГруппаПользователей <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
			// Удаление связей для удаленных пользователей.
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СоставГруппПользователей.Пользователь
				|ИЗ
				|	РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаГруппРодителей КАК ТаблицаГруппРодителей
				|			ПО (ТаблицаГруппРодителей.Ссылка = ГруппыПользователейСостав.Ссылка)
				|				И (ТаблицаГруппРодителей.Родитель = &ГруппаПользователей)
				|		ПО (СоставГруппПользователей.ГруппаПользователей = &ГруппаПользователей)
				|			И СоставГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь
				|ГДЕ
				|	СоставГруппПользователей.ГруппаПользователей = &ГруппаПользователей
				|	И ГруппыПользователейСостав.Ссылка ЕСТЬ NULL ";
				
			ПользователиУдаленныеИзГруппы = Запрос.Выполнить().Выбрать();
			МенеджерЗаписи = РегистрыСведений.СоставГруппПользователей.СоздатьМенеджерЗаписи();
			Пока ПользователиУдаленныеИзГруппы.Следующий() Цикл
				МенеджерЗаписи.ГруппаПользователей = ГруппаПользователей;
				МенеджерЗаписи.Пользователь        = ПользователиУдаленныеИзГруппы.Пользователь;
				МенеджерЗаписи.Удалить();
			КонецЦикла;
		КонецЕсли;
		
		// Добавление связей для добавленных пользователей.
		Если ГруппаПользователей = Справочники.ГруппыПользователей.ВсеПользователи Тогда
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи) КАК ГруппаПользователей,
				|	Пользователи.Ссылка КАК Пользователь
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
				|		ПО (СоставГруппПользователей.ГруппаПользователей = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи))
				|			И (СоставГруппПользователей.Пользователь = Пользователи.Ссылка)
				|ГДЕ
				|	СоставГруппПользователей.Пользователь ЕСТЬ NULL 
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	Пользователи.Ссылка,
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
				|		ПО (СоставГруппПользователей.ГруппаПользователей = Пользователи.Ссылка)
				|			И (СоставГруппПользователей.Пользователь = Пользователи.Ссылка)
				|ГДЕ
				|	СоставГруппПользователей.Пользователь ЕСТЬ NULL ";
		Иначе
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	&ГруппаПользователей КАК ГруппаПользователей,
				|	ГруппыПользователейСостав.Пользователь
				|ИЗ
				|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаГруппРодителей КАК ТаблицаГруппРодителей
				|		ПО (ТаблицаГруппРодителей.Ссылка = ГруппыПользователейСостав.Ссылка)
				|			И (ТаблицаГруппРодителей.Родитель = &ГруппаПользователей)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
				|		ПО (СоставГруппПользователей.ГруппаПользователей = &ГруппаПользователей)
				|			И (СоставГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь)
				|ГДЕ
				|	СоставГруппПользователей.Пользователь ЕСТЬ NULL ";
		КонецЕсли;
		ПользователиДобавленныеВГруппу = Запрос.Выполнить().Выгрузить();
		Если ПользователиДобавленныеВГруппу.Количество() > 0 Тогда
			НаборЗаписей = РегистрыСведений.СоставГруппПользователей.СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(ПользователиДобавленныеВГруппу);
			НаборЗаписей.Записать(Ложь); // Добавление недостающих записей связей.
		КонецЕсли;
		
		ГруппаПользователей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаПользователей, "Родитель");
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГруппыРодителя(Знач Родитель, Знач ТекущийРодитель, Знач ТаблицаЭлементов, Знач ТаблицаРодителей)
	
	ОписанияГруппРодителя = ТаблицаЭлементов.НайтиСтроки(Новый Структура("Родитель", ТекущийРодитель));
	Для каждого ОписаниеГруппы Из ОписанияГруппРодителя Цикл
		ОписаниеГруппыРодителя = ТаблицаРодителей.Добавить();
		ОписаниеГруппыРодителя.Родитель = Родитель;
		ОписаниеГруппыРодителя.Ссылка   = ОписаниеГруппы.Ссылка;
		ЗаполнитьГруппыРодителя(Родитель, ОписаниеГруппы.Ссылка, ТаблицаЭлементов, ТаблицаРодителей);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьГруппыРодителя

Функция ТаблицаГруппРодителей(Таблица)
	
	// Подготовка состава групп родителей.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыТаблицы.Ссылка,
		|	ГруппыТаблицы.Родитель
		|ИЗ
		|	" + Таблица + " КАК ГруппыТаблицы");
		
	ТаблицаЭлементов = Запрос.Выполнить().Выгрузить();
	ТаблицаЭлементов.Индексы.Добавить("Родитель");
	ТаблицаГруппРодителей = ТаблицаЭлементов.Скопировать(Новый Массив);
	
	Для каждого ОписаниеЭлемента Из ТаблицаЭлементов Цикл
		ОписаниеГруппыРодителя = ТаблицаГруппРодителей.Добавить();
		ОписаниеГруппыРодителя.Родитель = ОписаниеЭлемента.Ссылка;
		ОписаниеГруппыРодителя.Ссылка   = ОписаниеЭлемента.Ссылка;
		ЗаполнитьГруппыРодителя(ОписаниеЭлемента.Ссылка, ОписаниеЭлемента.Ссылка, ТаблицаЭлементов, ТаблицаГруппРодителей);
	КонецЦикла;
	
	Возврат ТаблицаГруппРодителей;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция КоличествоДоступныхОрганизаций(Знач Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(Пользователи.Организация) КАК КоличествоОрганизаций
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И Пользователи.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И НЕ Пользователи.ВходЗапрещен";
		
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", Пользователь.ИдентификаторПользователяИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоОрганизаций = Выборка.КоличествоОрганизаций;
	Иначе
		КоличествоОрганизаций = 0;
	КонецЕсли;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КоличествоОрганизаций;
	
КонецФункции // КоличествоДоступныхОрганизаций

Функция ДоступныеПользователи(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДоступныеПользователи = Новый Соответствие;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Организация КАК Организация,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ТекущийПользователь
		|		ПО (ТекущийПользователь.Ссылка = &Пользователь)
		|			И (ТекущийПользователь.ИдентификаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ)
		|ГДЕ
		|	Пользователи.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)");
		
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, ТекущийПользователь(), Пользователь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеПользователи.Вставить(Выборка.Организация, Выборка.Пользователь);
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДоступныеПользователи;

КонецФункции

Функция ЭтоНеуказанныйПользователь(Пользователь = Неопределено) Экспорт
	
	ПроверяемыйПользователь				= ?(Пользователь = Неопределено, ТекущийПользователь(), Пользователь);
	СвойстваНеуказанногоПользователя	= СвойстваНеуказанногоПользователя();
	
	Возврат (ПроверяемыйПользователь = СвойстваНеуказанногоПользователя.Ссылка);
	
КонецФункции

// Процедура - Проверить права доступа к документам подсистемы документооборот
//
Процедура ПроверитьПраваДоступаКДокументамПодсистемыДокументооборот() Экспорт

	Ошибки = Новый Массив;
	Если Не ПараметрыСеанса.ДоступныВсеСчетаДоверительногоУправления Тогда
		
		ДоступныеРолиКонтролераУК = Новый Массив;
		ДоступныеРолиКонтролераСК = Новый Массив;
		
		Для каждого Роль Из Метаданные.Роли Цикл
		
			Если СтрНачинаетсяС(Роль.Имя, "КонтрольУправляющихКомпаний") И РольДоступна(Роль) Тогда
				ДоступныеРолиКонтролераУК.Добавить(Роль);
			ИначеЕсли СтрНачинаетсяС(Роль.Имя, "КонтрольСтраховыхКомпаний") И РольДоступна(Роль) Тогда
				Если РольДоступна(Метаданные.Роли.Документооборот) 
					Или РольДоступна(Метаданные.Роли.ДокументооборотПросмотр) 
					Или РольДоступна(Метаданные.Роли.ДокументооборотРегистрацияДокументов) Тогда
					ДоступныеРолиКонтролераСК.Добавить(Роль);
				КонецЕсли; 				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если ДоступныеРолиКонтролераУК.Количество() > 0 Тогда
		    // Если контролеру УК назначены ограничения по счетам ДУ - возможны два вида проблем:
			// 1. Роли подсистемы Документооборот не назначены. Пользователь будет видеть только документы, у которых 
			// в табличной части Договоры пристутствуют счета ДУ, причем, доступ должен быть ко всем счетам ДУ документа.
			// 2. Роли подсистемы Документооборот назначены. Пользователь будет иметь доступ ко всем документам без учета РЛС
			Ошибки.Добавить("Обнаружен конфликт настройки доступа к счетам ДУ у пользователя " + ПараметрыСеанса.ТекущийПользователь + Символы.ПС + 
				"Включены ограничения доступа совместно с " + ?(ДоступныеРолиКонтролераУК.Количество() = 1, "ролью ", "ролями ") + 
				СтрСоединить(ДоступныеРолиКонтролераУК, " и "));
		КонецЕсли;
		
		Если ДоступныеРолиКонтролераСК.Количество() > 0 Тогда
			// Пользователю одновременно назначены роли подсистемы Документооборот и контролера СК. 
			// РЛС будет нормально работать, если не назначать роли подсистемы Документооборот, т.к. 
			// во входящих и исходящих документах СК в табличной части Договоры всегда есть одна строка, содержащая счет ДУ.
			// В противном случае, пользователь будет иметь доступ ко всем документам без учета РЛС
			Ошибки.Добавить("Обнаружен конфликт настройки доступа к счетам ДУ у пользователя " + ПараметрыСеанса.ТекущийПользователь + Символы.ПС +
				"Включены ограничения доступа совместно с " + ?(ДоступныеРолиКонтролераСК.Количество() = 1, "ролью ", "ролями ") + 
				СтрСоединить(ДоступныеРолиКонтролераСК, " и "));
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Ошибки.Количество() > 0 Тогда
	
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(СтрСоединить(Ошибки, Символы.ПС), "РаботаСПользователями.ПроверитьПраваДоступаКДокументамПодсистемыДокументооборот", Неопределено);
	
	КонецЕсли; 

КонецПроцедуры

//Проверяет текущего пользователя по доменному имени 
Функция ЭтоПолноправныйБухгалтерУКПИ() Экспорт
	
	Если ПараметрыСеанса.ТекущийПользователь = ОбщегоНазначения.ПолучитьИменованныйОбъект("Пользователь_КожуховаУКПИ")
		ИЛИ ПараметрыСеанса.ТекущийПользователь = ОбщегоНазначения.ПолучитьИменованныйОбъект("Пользователь_КаплинаУКПИ") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
